In [1]:
import pandas as pd
import numpy as np

<hr style="border-top: 10px groove darkorange; margin-top: 1px; margin-bottom: 1px"></hr>

# Tidy Data

___

## Attendance Data

Load the attendance.csv file and calculate an attendnace percentage for each student. One half day is worth 50% of a full day, and 10 tardies is equal to one absence.

In [5]:
att_df = pd.read_csv('untidy-data/attendance.csv', index_col=0)
att_df

,2018-01-01,2018-01-02,2018-01-03,2018-01-04,2018-01-05,2018-01-06,2018-01-07,2018-01-08
Sally,P,T,T,H,P,A,T,T
Jane,A,P,T,T,T,T,A,T
Billy,A,T,A,A,H,T,P,T
John,P,T,H,P,P,T,P,P

In [11]:
att_df = att_df.reset_index().rename(columns={'index': 'name'})
att_df

,name,2018-01-01,2018-01-02,2018-01-03,2018-01-04,2018-01-05,2018-01-06,2018-01-07,2018-01-08
0,Sally,P,T,T,H,P,A,T,T
1,Jane,A,P,T,T,T,T,A,T
2,Billy,A,T,A,A,H,T,P,T
3,John,P,T,H,P,P,T,P,P

In [13]:
# melt the data; one observation is one name and one day.

att_df = att_df.melt(id_vars='name')
att_df.sample(5)

     name    variable value
14  Billy  2018-01-04     A
30  Billy  2018-01-08     T
10  Billy  2018-01-03     A
17   Jane  2018-01-05     T
24  Sally  2018-01-07     T

In [15]:
# replace the categorical values in value with the numeric values

att_df['value'] = att_df.value.map({'P': 1, 'H': .5, 'T': .9, 'A': 0})
att_df.head()

    name    variable  value
0  Sally  2018-01-01    1.0
1   Jane  2018-01-01    0.0
2  Billy  2018-01-01    0.0
3   John  2018-01-01    1.0
4  Sally  2018-01-02    0.9

In [16]:
# calculate an overall average for each person.

att_df.groupby('name').value.mean()

name
Billy    0.5250
Jane     0.6875
John     0.9125
Sally    0.7625
Name: value, dtype: float64

___

## Coffee Levels

### Read the coffee_levels.csv file.

In [31]:
coffee_df = pd.read_csv('untidy-data/coffee_levels.csv', index_col=0)
coffee_df.sample(5)

     coffee_carafe  coffee_amount
hour
13               y       0.997464
16               y       0.544676
14               y       0.058361
14               z       0.864464
11               x       0.335533

### Transform the data so that each carafe is in it's own column.

In [41]:
coffee_pivot = coffee_df.reset_index().pivot_table(index='hour', columns='coffee_carafe')
coffee_pivot.sample(5)

              coffee_amount
coffee_carafe             x         y         z
hour
11                 0.335533  0.235529  0.311495
12                 0.898291  0.017009  0.771947
14                 0.507288  0.058361  0.864464
13                 0.310711  0.997464  0.398520
16                 0.183891  0.544676  0.280621

In [40]:
coffee_pivot.

              hour coffee_amount
coffee_carafe                  x         y         z
0                8      0.816164  0.189297  0.999264
1                9      0.451018  0.521502  0.915990
2               10      0.843279  0.023163  0.144928
3               11      0.335533  0.235529  0.311495
4               12      0.898291  0.017009  0.771947
5               13      0.310711  0.997464  0.398520
6               14      0.507288  0.058361  0.864464
7               15      0.215043  0.144644  0.436364
8               16      0.183891  0.544676  0.280621
9               17      0.391560  0.594126  0.436677

In [34]:
coffee_long = coffee_df.reset_index().pivot(index='coffee_carafe', columns='hour')
coffee_long

              coffee_amount                                                    \
hour                     8         9         10        11        12        13
coffee_carafe
x                  0.816164  0.451018  0.843279  0.335533  0.898291  0.310711
y                  0.189297  0.521502  0.023163  0.235529  0.017009  0.997464
z                  0.999264  0.915990  0.144928  0.311495  0.771947  0.398520


hour                 14        15        16        17
coffee_carafe
x              0.507288  0.215043  0.183891  0.391560
y              0.058361  0.144644  0.544676  0.594126
z              0.864464  0.436364  0.280621  0.436677